
#### 验证中国大陆身份证号码是否合法的函数 ####


fun_idno_verify <- function(x){
  

  # x <- c("45102519810711316X") # 定义函数过程中的测试数据

  
  # 备注：这里 x 和 X 大小写兼容，如果使用更严格规则，则 x 小写应该视为不合法字符，加一个新参数来控制是否要区分，默认兼容
  
  
  ########### 先用正则表达式校验基本规则 ###########################################################################
  
  # 15/18位身份证号码验证的正则表达式总结
  
  # xxxxxx yyyy MM dd 375 0     十八位
  # 
  # xxxxxx   yy MM dd  75 0     十五位
  # 
  # 
  # 地区：[1-9]\d{5}
  # 年的前两位：(18|19|([23]\d))            1800-3999
  # 年的后两位：\d{2}
  # 月份：((0[1-9])|(10|11|12)) 
  # 天数：(([0-2][1-9])|10|20|30|31)          闰年不能禁止29+
  #   
  # 三位顺序码：\d{3}
  # 
  # 两位顺序码：\d{2}
  #  
  # 校验码：[0-9Xx]
  # 
  #  
  # 十八位：^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$
  #   
  # 十五位：^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}[0-9Xx]$  
  
  
  # 长度不等于 15 或 18 即不合法，返回 FALSE
  if (!nchar(x) %in% c(18,15)) return(FALSE)
  
  # 长度等于 15 时只用正则表达式校验，不合法则返回 FALSE
  if (nchar(x) == 15) return(stringr::str_detect(x, "^[1-9]\\d{5}\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{2}[0-9Xx]$"))
  
  # 长度等于 18 时，先用正则表达式校验，不合法则返回 FALSE
  if (nchar(x) == 18 && !(stringr::str_detect(x, "^[1-9]\\d{5}(18|19|([23]\\d))\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{3}[0-9Xx]$"))) return(FALSE)
  

  
  ########### 用计算的方法来校验第18位校验码 ###########################################################################
  
  # 将身份证号码拆分成18个字符向量
  id_str <- substring(x, 1:18, 1:18)
  
  
  # 身份证号码前17位数字（向量）
  # 字符转化为数字，需要用来做数学运算
  id17 <- as.numeric(id_str[-18])
  
  # 身份证号码第18位数字
  id_18 <- ifelse(id_str[18] == 'x', 'X', id_str[18])
  
  # 前17个数字的权重系数：2的幂
  w <- 2^(17:1)
  
  # 前17个数字的权重和的余数
  remainder <- sum(id17 * w) %% 11
  
  
  # 余数列表
  # 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
  # 校验码对照表
  # 1, 0, X, 9, 8, 7, 6, 5, 4, 3, 2
  
  # X 是字符，这个向量都会转化为字符
  check_code <- c(1, 0, "X", 9, 8, 7, 6, 5, 4, 3, 2)
  
  # 校验省份证号码第18位（数字），是否与计算余数后对应的校验码是否相等
  return(id_18 == check_code[remainder+1])

}


#### 向量化 ####
vectorize_fun_idno_verify <- function(y) {
  sapply(y, fun_idno_verify, USE.NAMES = FALSE)
}
